Repository: common-repository/minicrm-woocommerce-sync
Catalog: languages/minicrm-woocommerce-sync-*.po
Languages: hu_hu

source: Sync all shop orders
hu_hu: Minden rendelés szinkronizálása

source: Test syncing
hu_hu: Próba-szinkronizáció

source: Full billing address
hu_hu: Teljes számlázási cím

source: Full billing name
hu_hu: Teljes számlázási név

source: Full shipping address
hu_hu: Teljes szállítási cím

source: Full shipping name
hu_hu: Teljes szállítási név

source: The number following "r3.minicrm.io/" in the URL after logging into your MiniCRM account.
hu_hu: A MiniCRM fiókodba bejelentkezve, az "r3.minicrm.hu/" részt követő szám.

source: eg. 12345
hu_hu: pl. 12345

source: System ID
hu_hu: SystemId (felhasználói rendszer azonosító)

source: If you sync multiple shops into a single MiniCRM account, you need to set a unique shop ID for each WooCommerce shop to avoid one shop overwriting another one's orders. If you sync a single shop only, then leave it on 0.
hu_hu: Ha több webshopot szinkronizálsz egyetlen MiniCRM fiókba, akkor minden webshopnak adj meg ebben a mezőben egyedi azonosítót. Így elkerülheted, hogy a különböző boltok egymás rendeléseit felülírják MiniCRM-ben. Ha egy MiniCRM fiókba csak egy webshopot szinkronizálsz, hagyd ezt az értéket 0-n.

source: Shop ID
hu_hu: Bolt azonosító

source: You can generate one in your MiniCRM account's Settings > System > API key > Create new API key
hu_hu: A MiniCRM fiókodban, a Beállítások > Rendszer > API kulcs > API kulcs újragenerálása gombbal hozhatod létre

source: API key
hu_hu: API kulcs

source: MiniCRM account locale
hu_hu: MiniCRM fiók nyelve

source: The number following "#!Project-" in the URL after opening the Webshop module in your MiniCRM account
hu_hu: A MiniCRM fiókod Webshop modulja megnyitásakor, az URL-ben látható "#!Project-" részt követő szám

source: eg. 21
hu_hu: pl. 21

source: The MiniCRM folder name for products imported along with webshop orders.
hu_hu: Azon mappa neve a MiniCRM-ben, ahova a tételnek be kell kerülnie.

source: eg. Webshop products
hu_hu: pl. Webshop termékek

source: Folder name
hu_hu: Mappanév

source: Turning it on can help diagnose issues. It is recommended to turn it off during normal operation.
hu_hu: A bekapcsolása segíthet a hibák felderítésében. Helyes működés esetén ajánlott kikapcsolni.

source: You can map basic WooCommerce order data to MiniCRM fields here. Write one per line in the following format: <br><code>[WooCommerce data]:[MiniCRM field]</code> <br> <br>You can use the ones below as <code>[WooCommerce data]</code>:
hu_hu: Itt párosíthatjuk a WooCommerce rendelések adatait MiniCRM mezőkkel. Soronként egyet adjunk meg a következő formátumban: <br><code>[WooCommerce adat]:[MiniCRM mező]</code> <br> <br>A <code>[WooCommerce adat]</code> helyére az alábbiak közül választhatunk:

source: You can also try other WooCommerce order data at your own risk (look for <code>get...()</code> methods of <a href="%s" target="_blank">WC_Order</a>.).
hu_hu: Saját felelősségre megpróbálhatsz egyéb WooCommerce rendelés adatokat is párosítani (keresd a <a href="%s" target="_blank">WC_Order</a> <code>get...()</code> metódusait).

source: You can use the text displayed as <em>Field label on HTML forms</em> while editing the custom fields of the <em>Order</em> module for a <code>[MiniCRM field]</code>. For example if you see <em>[Project.%1$s]</em> there, then use only <em>%1$s</em>. <br> <br>Separate the two fields in a single mapping with <code>:</code> (colon).
hu_hu: A <code>[MiniCRM mező]</code> helyére a Megrendelés modul egyedi mezőjének szerkesztésekor látható, <em>Mezőnév HTML űrlapokon</em> dobozban, a szögletes zárójelek között, a <em>Project.</em> részlet után megjelenő szöveg kerüljön! Pl. ha <em>[Project.%1$s]</em> szerepel a MiniCRM felületen, akkor a <em>%1$s</em> részletet másoljuk ki! <br> <br>A két mezőt pedig a <code>:</code> (kettőspont) írásjellel válasszuk el!

source: PostcodeOfShipping
hu_hu: SzallitasIranyitoszama

source: Example: shipping_postcode:PostcodeOfShipping shipping_city:CityOfShipping
hu_hu: Példa: shipping_postcode:SzallitasIranyitoszama shipping_city:SzallitasTelepulese

source: WooCommerce data mapping
hu_hu: WooCommerce mezőpárosítás

source: You can map <em>Extra Product Options</em> data to MiniCRM fields here. Write one mapping per line in the following format: <br><code>[Product Option]:[MiniCRM field]</code> <br> <br>Use the label displayed to the customer as a <code>[Product Option]</code> (the one typed under <em>Label</em> on the <em>Extra Product Options</em> admin)!
hu_hu: Itt párosíthatod az <em>Extra Product Options</em> termékjellemzőket a MiniCRM mezőkhöz. Soronként egyet írj az alábbi formátumban: <br><code>[Termékjellemző]:[MiniCRM mező]</code> <br> <br>A <code>[Termékjellemző]</code> helyére a vevőnek megjelenő termékjellemző felirata kerüljön (amit az <em>Extra Product Options</em> admin felületén, a termékjellemző szerkesztésekor a <em>Label</em> mezőbe írunk)!

source: TextOnTshirt
hu_hu: PoloFelirat

source: <strong>If you change the label of a product option</strong>, it's recommended that you keep the old mapping and add another one with the new label, since previous orders stored the product option with its old label.
hu_hu: <strong>Ha megváltoztatjuk egy termékjellemző feliratát</strong>, ajánlott megtartani a régi párosítást, és az újat is felvenni. A jellemzőket ugyanis a rendeléskori feliratukkal tárolja a bolt.

source: Example: T-shirt text:TextOnTshirt Extended warranty:ExtendedWarranty
hu_hu: Példa: Póló felirat:PoloFelirat Kiterjesztett garancia:KiterjesztettGarancia

source: Extra Product Options mapping
hu_hu: Extra Product Options mezőpárosítás

source: The API key is required and should consist of 32 alphanumeric characters. Please type the correct setting.
hu_hu: Az API kulcs megadása kötelező, és annak 32 betűből ill. számból kell állnia. Kérlek, töltsd ki helyesen a beállítást.

source: The category ID is required and should consist of digits only. Please type the correct setting.
hu_hu: A <em>CategoryId</em> megadása kötelező, és az csak számjegyekből állhat. Kérlek, adj meg helyes beállítást.

source: The folder name is required. Please type the correct setting.
hu_hu: A <em>mappanév</em> kitöltése kötelező. Kérlek, javítsd a beállítást.

source: The System ID is required and should consist of digits only. Please type the correct setting.
hu_hu: A <em>SystemId</em> megadása kötelező, és csak számjegyekből állhat. Kérlek, javítsd a beállítást.

source: The following WooCommerce mappings are invalid: %s
hu_hu: A következő WooCommerce adatok érvénytelenek: %s

source: The following MiniCRM mappings are invalid: %s
hu_hu: A következő MiniCRM mezők érvénytelenek: %s

source: The plugin is not yet tested on Wordpress version %s.
hu_hu: A bővítmény helyes működését még nem ellenőriztük a Wordpress %s verzióján.

source: PHP extension "%s" is required, but not loaded on your installation.
hu_hu: A következő PHP bővítmény szükséges a bővítmény működéséhez, de a telepítéseden nem elérhető: %s.

source: The sync hasn't finished yet. Are you sure to leave and abort it?
hu_hu: A szinkronizáció még folyamatban van. Biztosan félbeszakítod, és elhagyod az oldalt?

source: An unexpected <strong class="minicrm-woocommerce-sync-error">error occured</strong>, the sync was aborted. (Please check the Sync log).
hu_hu: Váratlan <strong class="minicrm-woocommerce-sync-error">hiba merült fel</strong>, a szinkronizáció félbeszakadt. (Kérlek, ellenőrizd a naplót.)

source: Finished syncing all (%s) projects. <strong class="minicrm-woocommerce-sync-success">No error</strong> occured, but complete success can only be verified from the Sync log.
hu_hu: %s adatlap sikeresen szinkronizálásra küldve. <strong class="minicrm-woocommerce-sync-success">Nem merült fel hiba</strong>, de a szinkronizáció tényleges sikeréről csak a <em>Sync</em> naplóból győződhetünk meg.

source: <strong>Syncing</strong>... %s% Remaining time: %s Keep the window open to finish.
hu_hu: <strong>Szinkronizálás</strong>... %s% Hátralévő idő: %s A befejezéshez tartsd nyitva a böngésző ablakát/lapját.
